<a href="https://colab.research.google.com/github/Anitagg1/Phyton-Workshop/blob/main/New%20prices.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [91]:
import pandas as pd
import numpy as np

from google.colab import drive
drive.mount("/content/drive")

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [92]:
wine_sales = pd.read_csv('/content/drive/My Drive/wine_sales_data.csv')

In [ ]:
wine_sales

In [93]:
portugal_wine = wine_sales[wine_sales['country'] == 'Portugal']

In [ ]:
portugal_wine

In [94]:
new_wines = portugal_wine[portugal_wine['province'] == 'Vinho Verde']

In [ ]:
new_wines.describe()

          Unnamed: 0      points       price
count     396.000000  396.000000  310.000000
mean    70480.558081   86.409091   11.400000
std     42469.897042    2.491366    4.821205
min       277.000000   80.000000    5.000000
25%     33405.000000   85.000000    8.000000
50%     72737.500000   86.000000   10.000000
75%    105342.250000   88.000000   13.000000
max    143575.000000   92.000000   45.000000

In [ ]:
new_wines

In [ ]:
new_wines['points'].value_counts().sort_index(ascending=True)

80     3
82    11
83    23
84    60
85    85
86    39
87    28
88    53
89    30
90    49
91    12
92     3
Name: points, dtype: int64

In [ ]:
new = new_wines.groupby("points").mean()

In [ ]:
new

          Unnamed: 0      price
points
80      38659.666667   8.000000
82      55707.545455   8.300000
83      65310.913043   7.500000
84      64456.600000   8.244444
85      66731.094118   9.918033
86      70691.487179  10.225806
87      70621.535714  12.714286
88      71340.094340  12.847826
89      87945.166667  13.653846
90      80556.510204  15.657143
91      72140.416667  16.428571
92      57714.666667  31.000000

In [101]:
new_wines['price'] = new_wines.groupby(['points'], sort=False)['price'].apply(lambda x: x.fillna(x.mean()))

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
new_wines.describe()

          Unnamed: 0      points       price
count     396.000000  396.000000  396.000000
mean    70480.558081   86.409091   11.434846
std     42469.897042    2.491366    4.457133
min       277.000000   80.000000    5.000000
25%     33405.000000   85.000000    8.286111
50%     72737.500000   86.000000   10.000000
75%    105342.250000   88.000000   13.000000
max    143575.000000   92.000000   45.000000

In [106]:
q_low = new_wines["price"].quantile(0.25)
q_hi  = new_wines["price"].quantile(0.75)

new_wines_filtered = new_wines[(new_wines["price"] < q_hi) & (new_wines["price"] > q_low)]

In [107]:
new_wines_filtered.describe()

          Unnamed: 0      points       price
count     182.000000  182.000000  182.000000
mean    65676.928571   86.076923   10.467440
std     43061.377031    1.936739    1.252697
min       993.000000   82.000000    8.300000
25%     29139.500000   85.000000    9.918033
50%     64466.500000   86.000000   10.000000
75%    100467.000000   88.000000   12.000000
max    143472.000000   90.000000   12.847826

In [ ]:
new_wines.isnull().sum()

In [ ]:
new_wines_filtered['points'].value_counts().sort_index(ascending=True)

In [108]:
new_wines_filtered['price'].value_counts(bins=3).sort_index(ascending=True)

(8.294, 9.816]      45
(9.816, 11.332]     85
(11.332, 12.848]    52
Name: price, dtype: int64